In [1]:
pip install pandas

Requirement already satisfied: pandas in /Users/souryagupta/Desktop/Machine_Learning/MachineLearning/numpyLearning/venv/lib/python3.13/site-packages (3.0.0)
Requirement already satisfied: numpy>=1.26.0 in /Users/souryagupta/Desktop/Machine_Learning/MachineLearning/numpyLearning/venv/lib/python3.13/site-packages (from pandas) (2.4.2)
Requirement already satisfied: python-dateutil>=2.8.2 in /Users/souryagupta/Desktop/Machine_Learning/MachineLearning/numpyLearning/venv/lib/python3.13/site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: six>=1.5 in /Users/souryagupta/Desktop/Machine_Learning/MachineLearning/numpyLearning/venv/lib/python3.13/site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Note: you may need to restart the kernel to use updated packages.

In [1]:
import pandas as pd

In [2]:
# A Pandas series is a one-dimensional array-like object that can hold any data type. It is similar to a column in a table.

import pandas as pd

data = [1, 2, 3, 4, 5]
series = pd.Series(data)
print("Series \n", series)
print(type(series))

Series
 0    1
1    2
2    3
3    4
4    5
dtype: int64
<class 'pandas.Series'>

In [3]:
# Create a series from dictionary
data = {"a": 1, "b": 2, "c": 3}
series_dict = pd.Series(data)
print(series_dict)

a    1
b    2
c    3
dtype: int64

In [4]:
data = [10, 20, 30]
index = ['a', 'b', 'c']
pd.Series(data, index=index)

a    10
b    20
c    30
dtype: int64

In [5]:
# Dataframe
# Create a Dataframe from a dic of list

data = {
    'Name': ['Krish', 'John', 'Jack'],
    "Age": [25, 30, 45],
    "City": ["Banglore", 'New York', 'Florida']   
}
df = pd.DataFrame(data)
print(df)
print(type(df))

    Name  Age      City
0  Krish   25  Banglore
1   John   30  New York
2   Jack   45   Florida
<class 'pandas.DataFrame'>

In [42]:
# Create a dataframe from a list of dictionaries:-

data = [
    {'Name': 'Krish', "Age": 20, "City": "Banglore"},
    {'Name': 'Sourya', "Age": 18, "City": "Banglore"},
    {'Name': 'Keshav', "Age": 20, "City": "Banglore"},
    {'Name': 'Dipu', "Age": 21, "City": "Banglore"},   
]
df = pd.DataFrame(data)
print(df)
print(type(df))

     Name  Age      City
0   Krish   20  Banglore
1  Sourya   18  Banglore
2  Keshav   20  Banglore
3    Dipu   21  Banglore
<class 'pandas.DataFrame'>

In [56]:
df = pd.read_csv('data.csv')
df.head(5)

   Duration          Date  Pulse  Maxpulse  Calories
0        60  '2020/12/01'    110       130     409.1
1        60  '2020/12/02'    117       145     479.0
2        60  '2020/12/03'    103       135     340.0
3        45  '2020/12/04'    109       175     282.4
4        45  '2020/12/05'    117       148     406.0

In [8]:
df.tail(5)

    Duration          Date  Pulse  Maxpulse  Calories
27        60  '2020/12/27'     92       118     241.0
28        60  '2020/12/28'    103       132       NaN
29        60  '2020/12/29'    100       132     280.0
30        60  '2020/12/30'    102       129     380.3
31        60  '2020/12/31'     92       115     243.0

In [9]:
# Accesing Data from Dataframe:-

data

[{'Name': 'Krish', 'Age': 20, 'City': 'Banglore'},
 {'Name': 'Sourya', 'Age': 18, 'City': 'Banglore'},
 {'Name': 'Keshav', 'Age': 20, 'City': 'Banglore'},
 {'Name': 'Dipu', 'Age': 21, 'City': 'Banglore'}]

In [10]:
df.loc[1] #For row

Duration              60
Date        '2020/12/02'
Pulse                117
Maxpulse             145
Calories           479.0
Name: 1, dtype: object

In [11]:
df.iloc[0]

Duration              60
Date        '2020/12/01'
Pulse                110
Maxpulse             130
Calories           409.1
Name: 0, dtype: object

In [23]:
# Accessing  a specified element
df.at[1, 'Name']

'Sourya'

In [24]:
# Accessing a specified element using iat
df.iat[2, 1]

np.int64(20)

In [25]:
# Data manipulation with Dataframe

df

     Name  Age      City
0   Krish   20  Banglore
1  Sourya   18  Banglore
2  Keshav   20  Banglore
3    Dipu   21  Banglore

In [44]:
# Adding new Column as Salary.
df['Aim'] = [500, 600, 200, 450]
df

     Name  Age      City  Aim
0   Krish   20  Banglore  500
1  Sourya   18  Banglore  600
2  Keshav   20  Banglore  200
3    Dipu   21  Banglore  450

In [45]:
# Remove a column
df.drop("Aim", axis=1, inplace=True)

In [46]:
df

     Name  Age      City
0   Krish   20  Banglore
1  Sourya   18  Banglore
2  Keshav   20  Banglore
3    Dipu   21  Banglore

In [47]:
df['Age'] = df['Age'] + 1
df

     Name  Age      City
0   Krish   21  Banglore
1  Sourya   19  Banglore
2  Keshav   21  Banglore
3    Dipu   22  Banglore

In [ ]:
df.drop(0) # This is a temporary

     Name  Age      City
1  Sourya   19  Banglore
2  Keshav   21  Banglore
3    Dipu   22  Banglore

In [53]:
df

     Name  Age      City
1  Sourya   19  Banglore
2  Keshav   21  Banglore
3    Dipu   22  Banglore

In [ ]:
# This a row operation
df.drop(1, inplace=True)

In [55]:
df

     Name  Age      City
2  Keshav   21  Banglore
3    Dipu   22  Banglore

In [63]:
# Display the data types of each column
print("Data types: \n", df.dtypes)

# Describe the DataFrame
print("Statistical summary: \n", df.describe())

# Group by a column and perform an aggregation
grouped = df.groupby('Pulse')['Calories'].mean()
print("Mean value by category: \n", grouped)

Data types:
 Duration      int64
Date            str
Pulse         int64
Maxpulse      int64
Calories    float64
dtype: object
Statistical summary:
          Duration       Pulse    Maxpulse    Calories
count   32.000000   32.000000   32.000000   30.000000
mean    68.437500  103.500000  128.500000  304.680000
std     70.039591    7.832933   12.998759   66.003779
min     30.000000   90.000000  101.000000  195.100000
25%     60.000000  100.000000  120.000000  250.700000
50%     60.000000  102.500000  127.500000  291.200000
75%     60.000000  106.500000  132.250000  343.975000
max    450.000000  130.000000  175.000000  479.000000
Mean value by category:
 Pulse
90            NaN
92     242.000000
97     243.000000
98     253.066667
100    268.900000
102    338.266667
103    330.766667
104    316.300000
105    246.000000
106    345.300000
108    364.200000
109    238.750000
110    391.550000
117    442.500000
130    300.000000
Name: Calories, dtype: float64